yaxunit_education/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС0</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

yaxunit_education/src/CommonModules/РасчетНДС/Module.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Числовое значение ставки по перечислению
// 
// Параметры:
//  СтавкаНДС  - ПеречислениеСсылка.СтавкиНДС
// 
// Возвращаемое значение:
//  Число - Значение ставки
///
Функция ЗначениеСтавки(СтавкаНДС) Экспорт
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		Возврат 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		Возврат 10;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат 20;
	Иначе
		ВызватьИсключение "Ставка не поддерживается";
	КонецЕсли;
	
КонецФункции
#КонецОбласти

#КонецЕсли
